<?php
    return [
        "name" => [
            "required" => "حقل الاسم مطلوب",
            "string" => "حقل الاسم يجب أن يكون نصًا",
            "min" => "حقل الاسم يجب أن يكون على الأقل 3 أحرف",
            "max" => "حقل الاسم يجب أن لا يتجاوز 255 حرفًا",
        ],
        "email" => [
            "required" => "حقل البريد الإلكتروني مطلوب",
            "email" => "حقل البريد الإلكتروني يجب أن يكون بريدًا إلكترونيًا صالحًا",
            "unique" => "البريد الإلكتروني مستخدم بالفعل",
        ],
        "phone" => [
            "required" => "حقل الهاتف مطلوب",
            "digits_between" => "حقل الهاتف يجب أن يكون بين 10 و 15 رقمًا",
            "unique" => "رقم الهاتف مستخدم بالفعل",
        ],
        "password" => [
            "required" => "حقل كلمة المرور مطلوب",
            "string" => "حقل كلمة المرور يجب أن يكون نصًا",
            "min" => "حقل كلمة المرور يجب أن يكون على الأقل 8 أحرف",
            "confirmed" => "تأكيد كلمة المرور غير متطابق",
        ],
        "login" => [
            "required" => "حقل تسجيل الدخول مطلوب",
            "string" => "حقل تسجيل الدخول يجب أن يكون نصًا",
        ]
    ]
?>